Revit 2024 API
EnergyAnalysisDetailModel.GetAnalyticalOpenings Method
 The collection of analytical openings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<EnergyAnalysisOpening> GetAnalyticalOpenings()
Visual Basic
Public Function GetAnalyticalOpenings As IList(Of EnergyAnalysisOpening)
Visual C++
public:
IList<EnergyAnalysisOpening^>^ GetAnalyticalOpenings()
Return Value
 Returns the analytical openings after model calculation.
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace